# Data Frames

DataFrames are the workhorse of pandas and are directly inspirede by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [2]:
df = pd.DataFrame(randn(5,4),index ="A B C D E".split(),columns='W X Y Z'.split())

In [3]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [4]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [5]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [6]:
df.Z

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

### Adding a column

In [7]:
df['XY'] = df['X']+df['Y']
df

          W         X         Y         Z        XY
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

When youu want to remove a row or column from a data set, you can use dataframe.drop(Name,axis,inplace=True).
Where, if you want to remove a row,axis=0, and if you wanna remove a column,axis=1
If you want to delete the data permanently then you can use 'inplace=True', so that the next time you call the data set it'll be removed. Otherwise you just remove the data from that session

In [8]:
df.drop('E',axis=0)

          W         X         Y         Z        XY
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109

In [9]:
df.drop('E',axis=0,inplace=True)
df

          W         X         Y         Z        XY
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109

### Selecting a data set

Selecting based on label

In [10]:
df.loc['A']

W     2.706850
X     0.628133
Y     0.907969
Z     0.503826
XY    1.536102
Name: A, dtype: float64

Selecting based on index/rows

In [11]:
df.iloc[1]

W     0.651118
X    -0.319318
Y    -0.848077
Z     0.605965
XY   -1.167395
Name: B, dtype: float64

In [12]:
df.loc[['B','C']]

          W         X         Y         Z        XY
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936

In [13]:
df.iloc[1:3]

          W         X         Y         Z        XY
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936

In [14]:
df.loc[['B','D'],['X','Z']]

          X         Z
B -0.319318  0.605965
D -0.758872  0.955057

In [15]:
df[['X','Z']].loc[['B','D']]

          X         Z
B -0.319318  0.605965
D -0.758872  0.955057

In [16]:
df[['X','Z']].iloc[[1,3]]

          X         Z
B -0.319318  0.605965
D -0.758872  0.955057

###  Conditional Selection

An important feature of pandas is conditional selection using a boolean exxpression

In [17]:
df

          W         X         Y         Z        XY
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109

In [18]:
df>0.5

       W      X      Y      Z     XY
A   True   True   True   True   True
B   True  False  False   True  False
C  False   True   True  False   True
D  False  False  False   True  False

In [19]:
df[df>0.5]

          W         X         Y         Z        XY
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN  1.268936
D       NaN       NaN       NaN  0.955057       NaN

In [20]:
df[df>0.5]['Z']

A    0.503826
B    0.605965
C         NaN
D    0.955057
Name: Z, dtype: float64

In [21]:
df[df>0.5].loc['C']

W          NaN
X     0.740122
Y     0.528813
Z          NaN
XY    1.268936
Name: C, dtype: float64

For two conditions you can use | or & with parenthesis

In [22]:
df[(df['W']>0.5) & (df.loc['C']<0.5)]

C:\Users\zalego\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

Empty DataFrame
Columns: [W, X, Y, Z, XY]
Index: []

In [23]:
df

          W         X         Y         Z        XY
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109

In [24]:
df.describe()

              W         X         Y         Z        XY
count  4.000000  4.000000  4.000000  4.000000  4.000000
mean   0.382124  0.072516 -0.086133  0.368962 -0.013617
std    1.938687  0.730102  0.942434  0.667223  1.652787
min   -2.018168 -0.758872 -0.933237 -0.589001 -1.692109
25%   -0.363021 -0.429207 -0.869367  0.230619 -1.298574
50%    0.419907  0.154407 -0.159632  0.554896  0.050770
75%    1.165051  0.656130  0.623602  0.693238  1.335727
max    2.706850  0.740122  0.907969  0.955057  1.536102

In [25]:
df.dtypes

W     float64
X     float64
Y     float64
Z     float64
XY    float64
dtype: object

### Missing Data

Let's show a few convinient

In [26]:
df1 = pd.DataFrame({"A":[1,2,np.nan],"B":[5,np.nan,np.nan],"C":[1,2,3]},[1,2,3])
df1

     A    B  C
1  1.0  5.0  1
2  2.0  NaN  2
3  NaN  NaN  3

In [27]:
df1.dropna()

     A    B  C
1  1.0  5.0  1

In [28]:
df1

     A    B  C
1  1.0  5.0  1
2  2.0  NaN  2
3  NaN  NaN  3

In [29]:
df1.dropna(axis=1)

   C
1  1
2  2
3  3

In [30]:
df1

     A    B  C
1  1.0  5.0  1
2  2.0  NaN  2
3  NaN  NaN  3

In [31]:
df1.dropna

<bound method DataFrame.dropna of      A    B  C
1  1.0  5.0  1
2  2.0  NaN  2
3  NaN  NaN  3>

In [32]:
df1.fillna(value="FILL VALUE")

            A           B  C
1           1           5  1
2           2  FILL VALUE  2
3  FILL VALUE  FILL VALUE  3

In [33]:
df1

     A    B  C
1  1.0  5.0  1
2  2.0  NaN  2
3  NaN  NaN  3

In [34]:
df1['A'].fillna(value=df1['A'].mean())

1    1.0
2    2.0
3    1.5
Name: A, dtype: float64

In [35]:
df1

     A    B  C
1  1.0  5.0  1
2  2.0  NaN  2
3  NaN  NaN  3

## Adding Indexes

In [36]:
weather = pd.DataFrame(randn(5,4),index ="Monday Tuesday Wednesday Thursday Friday".split(),columns='Rainfall Wind Temp Humidity'.split())
counties = 'Nrb Msa Ksm Nkr Mrg'.split()

In [37]:
weather['County']= counties
weather

           Rainfall      Wind      Temp  Humidity County
Monday     0.302665  1.693723 -1.706086 -1.159119    Nrb
Tuesday   -0.134841  0.390528  0.166905  0.184502    Msa
Wednesday  0.807706  0.072960  0.638787  0.329646    Ksm
Thursday  -0.497104 -0.754070 -0.943406  0.484752    Nkr
Friday    -0.116773  1.901755  0.238127  1.996652    Mrg

In [38]:
weather.set_index("County")

        Rainfall      Wind      Temp  Humidity
County
Nrb     0.302665  1.693723 -1.706086 -1.159119
Msa    -0.134841  0.390528  0.166905  0.184502
Ksm     0.807706  0.072960  0.638787  0.329646
Nkr    -0.497104 -0.754070 -0.943406  0.484752
Mrg    -0.116773  1.901755  0.238127  1.996652

In [39]:
weather_county = weather.set_index("County")
weather_county

        Rainfall      Wind      Temp  Humidity
County
Nrb     0.302665  1.693723 -1.706086 -1.159119
Msa    -0.134841  0.390528  0.166905  0.184502
Ksm     0.807706  0.072960  0.638787  0.329646
Nkr    -0.497104 -0.754070 -0.943406  0.484752
Mrg    -0.116773  1.901755  0.238127  1.996652

In [40]:
weather.reset_index()

       index  Rainfall      Wind      Temp  Humidity County
0     Monday  0.302665  1.693723 -1.706086 -1.159119    Nrb
1    Tuesday -0.134841  0.390528  0.166905  0.184502    Msa
2  Wednesday  0.807706  0.072960  0.638787  0.329646    Ksm
3   Thursday -0.497104 -0.754070 -0.943406  0.484752    Nkr
4     Friday -0.116773  1.901755  0.238127  1.996652    Mrg

DataFrame.reindex() can repostion your columns

In [41]:
weather = weather.reindex(columns=['Temp',"Rainfall","Humidity","Wind"])
weather

               Temp  Rainfall  Humidity      Wind
Monday    -1.706086  0.302665 -1.159119  1.693723
Tuesday    0.166905 -0.134841  0.184502  0.390528
Wednesday  0.638787  0.807706  0.329646  0.072960
Thursday  -0.943406 -0.497104  0.484752 -0.754070
Friday     0.238127 -0.116773  1.996652  1.901755